import { motion } from "framer-motion";

const About = () => {
  return (
    <motion.div
      initial={{ opacity: 0 }}
      animate={{ opacity: 1 }}
      exit={{ opacity: 0 }}
    >
      <section>
        <h1>Про нашу платформу</h1>
        <p>
          Наша розробницька платформа - це інноваційний інструмент для створення
          сучасних веб-сайтів та додатків. Ми надаємо можливість командам
          розробників спільно працювати над проектами, використовувати найкращі
          практики та забезпечувати високу якість рішень для наших клієнтів.
        </p>
        <p>
          Наша платформа допомагає вам керувати проектами, відстежувати робочий
          процес, спілкуватися з клієнтами та створювати унікальні рішення, які
          виділяють ваш бізнес на ринку.
        </p>
      </section>
    </motion.div>
  );
};

export default About;
