import { Link } from "react-router-dom";

export const projects = [
  {
    id: 1,
    title: 'Веб-сайт для ресторану "Смак Острова"',
    description:
      "Розробка веб-сайту для ресторану, включаючи меню та замовлення онлайн.",
  },
  {
    id: 2,
    title: 'E-commerce платформа "Модні Тренди"',
    description:
      "Створення онлайн-магазину для продажу модного одягу та аксесуарів.",
  },
  {
    id: 3,
    title: 'Блог "Подорожі Світом"',
    description:
      "Розробка блогу для подорожів з можливістю додавання фотографій та відгуків.",
  },
  {
    id: 4,
    title: 'CRM система для "Tech Solutions"',
    description:
      "Створення системи управління клієнтами для інформаційної компанії.",
  },
  {
    id: 5,
    title: 'Інтернет-магазин "Електрофікс"',
    description:
      "Розробка електронного магазину для продажу електроінструментів та обладнання.",
  },
  {
    id: 6,
    title: 'Платформа для онлайн-курсів "НавчайМайбутнє"',
    description:
      "Створення платформи для навчання з можливістю додавання відеоуроків та завдань.",
  },
  {
    id: 7,
    title: 'Медичний інформаційний портал "ЗдоровийСвіт"',
    description:
      "Розробка інформаційного порталу з медичною інформацією та консультаціями.",
  },
  {
    id: 8,
    title: 'Соціальна мережа "ДрузіКреативу"',
    description:
      "Створення соціальної мережі для обміну творчими ідеями та проектами.",
  },
  {
    id: 9,
    title: "Портфоліо сайтів та додатків",
    description:
      "Створення власного портфоліо для показу робіт та навичок в розробці.",
  },
  {
    id: 10,
    title: 'Онлайн-галерея мистецтва "ArtExpo"',
    description:
      "Розробка онлайн-галереї для показу та продажу мистецьких творів.",
  },
];

const Projects = () => {
  return (
    <ul>
      {projects.map((project) => (
        <li key={project.id}>
          <Link to={`/projects/${project.id}`}>{project.title}</Link>
        </li>
      ))}
    </ul>
  );
};

export default Projects;
